# set arguments for all 'brew cask install' commands
cask_args appdir: "~/Applications", require_sha: true

##########################
#  FOR THE COMMAND LINE  #
##########################
brew 'zsh'
brew 'bash'
## for the experience
brew 'powerlevel10k' # prompt
brew 'tmux'          # 'muxing
brew 'hello'         # essential greeting
brew 'htop'          # seeing if I'm running too much code
brew 'graphviz'      # graph visualization
## "swiss-army-knives"
brew 'ffmpeg' # video
brew 'pandoc' # text
brew 'sox'    # audio
## for encryption
brew 'gnupg'
brew 'pinentry-mac' # for typing in my password
## compression
brew 'p7zip'
brew 'xz'
## dependancy
brew 'ispell' # spelling

###############
#  DEV TOOLS  #
###############
## for buildling code
brew 'cmake'
brew 'ninja'
## git!
brew 'git'
brew 'git-lfs'
## for running code
brew 'go'
brew 'lua'
brew 'mono'    # C#
brew 'nasm'    # Assembly
brew 'node'    # Javascript / ECMAscript
brew 'openjdk' # Java
brew 'pypy3'   # just in case
brew 'python3'
brew 'ruby'
brew 'rust'
## for running more code
brew 'pkg-config' # for finding the code
brew 'qemu'       # for running code without an operating system
brew 'sqlite'     # when needed
## for convenience
brew 'gh' # GitHub CLI
## for programming
brew 'macvim'
## libraries
brew 'cairo'    # rendering
brew 'glib'     # C data structures
brew 'harfbuzz' # text shaping
brew 'icu4c'    # for i18n
brew 'libffi'   # "Foreign Function Interface"
brew 'ncurses'  # for CLI interactivity
brew 'openssl'  # for security
brew 'pango'    # laying out text


###########
#  CASKS  #
###########
## Art
cask 'blender'  # 3D
cask 'gimp'     # Raster images
cask 'inkscape' # Vector images
cask 'musescore' # Music
## Games
cask 'minecraft'
# cask 'openrct2' # I like to make custom compilations
## Using other computers
cask 'vmware-horizon-client' # for Windows on the very odd occasion
cask 'vnc-viewer'            # for a Raspberry Pi
## Programming
cask 'atom' # When I don't want Visual Studio Code
cask 'eclipse-java' # When I'm not allowed to use C++.
cask 'emacs' # I heard it's recommended to be as a gui
cask 'visual-studio-code' # When I'm React-ing
cask 'qt-creator' # For when I'm struggling in C++.
## LaTeX
cask 'mactex'
cask 'tex-live-utility'
## Other
cask 'duet'                   # Because I have an old computer
cask 'google-backup-and-sync' # For my stuff
cask 'microsoft-office'       # To render Word documents to PDF
cask 'zoomus'                 # Pandemic
cask 'zotero'                 # Citations
## Why do I keep dragging these around?
cask 'discord'       # I don't have anyone to talk to
cask 'docker'        # I don't have enough RAM
cask 'google-chrome' # Takes too many resources
cask 'handbrake'     # ffmpeg seems to compress better
cask 'iterm2'        # Uses too many resources comparatively

###############
#  APP STORE  #
###############
mas "Adblock PLus", id: 1432731683
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "XCode", id: 497799835
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825

